package uniShop;

import GUI.*;

public class Main {
	
	/*ΟΜΑΔΑ 8 : Πλατφόρμα καταχώρησης αγγελιών κάθε είδους προϊόντων και αγγελιών.
	 * Τα μέλη της ομάδας : dai19146,dai19098,dai19005,dai19096,dai19187,dai19144,dai19180,dai19072
	 * 
	 * Ο κώδικας μεταγλωτίζεται και τρέχει.
	 * Ωστόσο δεν έχουν υλοποιηθεί κάποια πράγματα. Αρχικά δεν υπάρχει
	 * ξεχωριστή βάση δεδομένων. Για βάση δεδομενων χρησιμοποιείται η 
	 * κλάση LocalDataBase η οποία στην ουσία είναι 
	 * μία τοπική βάση με όλα τα απαραίτητα αντικείνενα.
	 * Επιπλέον απο τις σύνθετες λειτουργίες που ορίστηκαν στην αρχή
	 * ΕΧΕΙ υλοποιηθεί η εμφάνιση σχετικων αγγελιών στον αγοραστή βάσει
	 * τα ενδιαφέροντα του μέσω της μεθόδου filter κατα την αναζήτηση. 
	 * Επίσης έχει υλοποιηθεί και η προώθηση αγγελιών επι πληρωμή καθώς 
	 * εμφανίζονται πρώτες στην κεντρικη οθόνη και αμέσως μετα τις αναζητήσεις.
	 * ΔΕΝ έχει υλοποιηθεί η δυνατότητα αξιολόγησης πωλητή/αγοραστή.
	 * Τέλος ύπαρχει ενα πρόβλημα στα κουμπιά register και login καθώς δεν 
	 * φαίνονται μόλις ανοίξει το πρόγραμμα. Βρίσκονται πανω δεξία , μόλις περάσει
	 * απο πάνω το ποντίκι εμφανίζονται. Το ίδιο συμβαίνει και στην createNewAd με
	 * τα tags. Αρκεί να κουνηθεί το scroll και εμφανίζονται.
	 * 
	 * 
	 */

	public static void main(String[] args) {
		
		LocalDataBase db = new LocalDataBase();
		
		new HomeScreen_Guest(db);
	}

}
